### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # cloudflare_pages_domain.seichi_portal_domain will be created
+   resource "cloudflare_pages_domain" "seichi_portal_domain" {
+       domain       = "portal.seichi.click"
+       id           = (known after apply)
+       project_name = "seichi-portal"
+       status       = (known after apply)
    }

  # cloudflare_pages_project.seichi_portal will be created
+   resource "cloudflare_pages_project" "seichi_portal" {
+       created_on        = (known after apply)
+       domains           = (known after apply)
+       id                = (known after apply)
+       name              = "seichi-portal"
+       production_branch = "main"
+       subdomain         = (known after apply)

+       build_config {
+           build_command   = "yarn build"
+           destination_dir = "out"
+           root_dir        = "/"
        }

+       source {
+           type = "github"

+           config {
+               deployments_enabled           = true
+               owner                         = "GiganticMinecraft"
+               pr_comments_enabled           = true
+               preview_deployment_setting    = "all"
+               production_branch             = "main"
+               production_deployment_enabled = true
+               repo_name                     = "seichi-portal-frontend"
            }
        }
    }

  # cloudflare_record.portal will be updated in-place
!   resource "cloudflare_record" "portal" {
        id              = "81784b1c8b1e599f0a1730092df1e819"
        name            = "portal"
        tags            = []
!       value           = "giganticminecraft.github.io" -> "seichi-portal.pages.dev"
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>